tenergyinnovation/esp32_iot_all_v3/src/esp32_iot_all_v3.cpp
  crc ^= a;
  for (i = 0; i < 8; ++i)
  {
    if (crc & 1)
      crc = (crc >> 1) ^ 0xA001;
    else
      crc = (crc >> 1);
  }

  return crc;
}

/***********************************************************************
 * FUNCTION:    PWN_Setup
 * DESCRIPTION: Pulse Width Mod setting up
 * PARAMETERS:  channel[0-15], frequency(Hz), resolution[1-15], pin
 * RETURNED:    0 = error, 1 = pass
 ***********************************************************************/
bool esp32_iot_all_v3::PWM_Setup(uint8_t channel, double freq, uint8_t resolution_bit, uint8_t pin)
{
  if (channel > 15 || channel < 0 || resolution_bit > 15 || resolution_bit < 1)
  {
    Serial.printf("Error: wrong parameter!!\r\n");
    return 0;
  }
  ledcSetup(channel, freq, resolution_bit);
  ledcAttachPin(pin, channel);
  _resolution_bit = resolution_bit;
  return 1;
}

/***********************************************************************
 * FUNCTION:    PWM_Drive
 * DESCRIPTION: Pulse Width Mod drive
 * PARAMETERS:  channel[0-15], percentage[0-100]
 * RETURNED:    0 = error, 1 = pass
 ***********************************************************************/
bool esp32_iot_all_v3::PWM_Drive(uint8_t channel, uint8_t percentage)
{
  double _duty = 0;

  if (percentage > 100 || percentage < 0)
  {
    Serial.printf("Error: Out of range parameter\r\n");
    return 0;
  }
  else
  {
    // Serial.printf("_resolution_bit = %d\r\n",_resolution_bit);
    // Serial.printf("percentage = %d\r\n",percentage);

    if (_resolution_bit == 1)
      _duty = (double)percentage * 0.02;
    else if (_resolution_bit == 2)
      _duty = (double)percentage * 0.04;
    else if (_resolution_bit == 3)
      _duty = (double)percentage * 0.08;
    else if (_resolution_bit == 4)
      _duty = (double)percentage * 0.16;
    else if (_resolution_bit == 5)
      _duty = (double)percentage * 0.32;
    else if (_resolution_bit == 6)
      _duty = (double)percentage * 0.64;
    else if (_resolution_bit == 7)
      _duty = (double)percentage * 1.28;
    else if (_resolution_bit == 8)
      _duty = (double)percentage * 2.56;
    else if (_resolution_bit == 9)
      _duty = (double)percentage * 5.12;
    else if (_resolution_bit == 10)
      _duty = (double)percentage * 10.24;
    else if (_resolution_bit == 11)
      _duty = (double)percentage * 20.48;
    else if (_resolution_bit == 12)
      _duty = (double)percentage * 40.96;
    else if (_resolution_bit == 13)
      _duty = (double)percentage * 81.92;
    else if (_resolution_bit == 14)
      _duty = (double)percentage * 163.84;
    else if (_resolution_bit == 15)
      _duty = (double)percentage * 327.68;

    ledcWrite(channel, _duty);
    // Serial.printf("Debug: duty = %f\r\n",_duty);
    return 1;
  }
}

/***********************************************************************
 * FUNCTION:    Frequency_Out
 * DESCRIPTION: Generate Frequency to pin 5,18,23,19 but else not allow
 * PARAMETERS:  pin=[5,18,23 and 19], freq=0-19500Hz
 * RETURNED:    0 = error, 1 = pass
 ***********************************************************************/
bool esp32_iot_all_v3::Frequency_Out(uint8_t pin, double freq)
{

  uint8_t _channel;

  /* check pin */
  if ((pin != 5) && (pin != 18) && (pin != 23) && (pin != 19))
  {
    Serial.printf("Error: parameter input pin must be 5,18,23,19 but else is not allow\r\n");
    return 0;
  }
  else
  {
    /* define channel */
    switch (pin)
    {
    case 5:
      _channel = 1;
      break;
    case 18:
      _channel = 3;
      break;
    case 23:
      _channel = 5;
      break;
    case 19:
      _channel = 7;
      break;
    default:
      break;
    }
  }

  /* check frequency */
  if ((freq < 0) || (freq > 19500))
  {
    Serial.printf("Error: Out of range frequency [0-19500Hz]\r\n");
    return 0;
  }

  /* set 0 Hz */
  if (freq == 0)
  {
#ifdef modbusRTU_Debug
    Serial.printf("Info: pin = %d, channel = %d, frequency = %.0fHz\r\n", pin, _channel, freq);
#endif
    ledcSetup(_channel, 1, 12);
    ledcAttachPin(pin, _channel);
    ledcWrite(pin, 0);
    vTaskDelay(300);
    return 1;
  }
  else
  {
#ifdef modbusRTU_Debug
    Serial.printf("Info: pin = %d, channel = %d, frequency = %.0fHz\r\n", pin, _channel, freq);
#endif
    ledcSetup(_channel, freq, 12);
    ledcAttachPin(pin, _channel);
    ledcWrite(_channel, 4095 / 2);
    vTaskDelay(300);

    ledcSetup(_channel, freq, 12); //<- Fix bug by need to re-run command
    ledcAttachPin(pin, _channel);
    ledcWrite(_channel, 4095 / 2);
    vTaskDelay(300);
    return 1;
  }
}

#pragma region OLED PICTURE

/***********************************************************************
   FUNCTION:    drawProgressBarDemo
   DESCRIPTION: drawProgressBarDemo
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void drawProgressBarDemo()
{
  int progress = (counter / 5) % 100;
  // draw the progress bar
  display.drawProgressBar(0, 32, 120, 10, progress);

  // draw the percentage as String
  display.setTextAlignment(TEXT_ALIGN_CENTER);
  display.drawString(64, 15, String(progress) + "%");
}

/***********************************************************************
  FUNCTION:    tenergyImage
  DESCRIPTION: tenergyImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void tenergyImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(0, 0, Tenergy_Logo_width, Tenergy_Logo_height, Tenergy_Logo_bits);
}

/***********************************************************************
  FUNCTION:    WiFiImage
  DESCRIPTION: WiFiImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void WiFiImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(34, 14, WiFi_Logo_width, WiFi_Logo_height, WiFi_Logo_bits);
}

/***********************************************************************
  FUNCTION:    hotspotImage
  DESCRIPTION: hotspotImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void WiFiOnImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(34, 14, WiFi_on_Logo_width, WiFi_on_Logo_height, WiFi_on_bits);
}

/***********************************************************************
  FUNCTION:    hotspotoffImage
  DESCRIPTION: hotspotoffImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void WiFiOffImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(47, 16, WiFi_off_Logo_width, WiFi_off_Logo_height, WiFi_off_bits);
}

/***********************************************************************
  FUNCTION:    HotspotImage
  DESCRIPTION: HotspotImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void HotspotImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(40, 15, hotspot_Logo_width, hotspot_Logo_height, hotspot_bits);
}

/***********************************************************************
  FUNCTION:    WiFiCoffeeImage
  DESCRIPTION: WiFiCoffeeImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void WiFiCoffeeImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(40, 14, wificoffee_Logo_width, wificoffee_Logo_height, wificoffee_bits);
}

/***********************************************************************
  FUNCTION:    FacebookImage
  DESCRIPTION: FacebookImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void FacebookImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(45, 19, facebook_Logo_width, facebook_Logo_height, facebook_bits);
}

/***********************************************************************
  FUNCTION:    BugImage
  DESCRIPTION: BugImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void BugImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(45, 19, bug_Logo_width, bug_Logo_height, bug_bits);
}

/***********************************************************************
  FUNCTION:    FixImage
  DESCRIPTION: FixImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void FixImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(45, 15, maintenance_Logo_width, maintenance_Logo_height, maintenance_bits);
}

/***********************************************************************
  FUNCTION:    CameraImage
  DESCRIPTION: CameraImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void CameraImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(30, 10, camera_Logo_width, camera_Logo_height, camera_bits);
}

/***********************************************************************
  FUNCTION:    ClockImage
  DESCRIPTION: ClockImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void ClockImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(35, 10, clock_Logo_width, clock_Logo_height, clock_bits);
}

/***********************************************************************
  FUNCTION:    MotorImage
  DESCRIPTION: MotorImage
  PARAMETERS:  nothing
  RETURNED:    nothing
***********************************************************************/
void MotorImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(35, 10, motor_dc_Logo_width, motor_dc_Logo_height, motor_dc_bits);
}

/***********************************************************************
   FUNCTION:    EepromImage
   DESCRIPTION: EepromImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void EepromImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(30, 6, eeprom_Logo_width, eeprom_Logo_height, eeprom_bits);
}

/***********************************************************************
   FUNCTION:    HomeImage
   DESCRIPTION: HomeImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void HomeImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(40, 15, home_Logo_width, home_Logo_height, home_bits);
}

/***********************************************************************
   FUNCTION:    LedImage
   DESCRIPTION: LedImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void LedImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(40, 15, led_Logo_width, led_Logo_height, led_bits);
}

/***********************************************************************
   FUNCTION:    MotionImage
   DESCRIPTION: MotionImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void MotionImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(40, 15, motion_Logo_width, motion_Logo_height, motion_bits);
}

/***********************************************************************
   FUNCTION:    RelayImage
   DESCRIPTION: RelayImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void RelayImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(45, 10, relay_Logo_width, relay_Logo_height, relay_bits);
}

/***********************************************************************
   FUNCTION:    Rs485Image
   DESCRIPTION: Rs485Image
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void Rs485Image()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(38, 10, rs485_Logo_width, rs485_Logo_height, rs485_bits);
}

/***********************************************************************
   FUNCTION:    SteppingImage
   DESCRIPTION: SteppingImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void SteppingImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(45, 15, stepping_Logo_width, stepping_Logo_height, stepping_bits);
}

/***********************************************************************
   FUNCTION:    TemperatureImage
   DESCRIPTION: TemperatureImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void TemperatureImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  //  display.drawXbm(45, 15, temperature_Logo_width, temperature_Logo_height, temperature_bits); //center
  display.drawXbm(45, 3, temperature_Logo_width, temperature_Logo_height, temperature_bits); // top
}

/***********************************************************************
   FUNCTION:    Tmp1638Image
   DESCRIPTION: Tmp1638Image
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void Tmp1638Image()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(12, 5, tmp1638_Logo_width, tmp1638_Logo_height, tmp1638_bits);
}

/***********************************************************************
   FUNCTION:    UltrasonicImage
   DESCRIPTION: UltrasonicImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void UltrasonicImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(35, 8, ultrasonic_Logo_width, ultrasonic_Logo_height, ultrasonic_bits);
}

/***********************************************************************
   FUNCTION:    UtenImage
   DESCRIPTION: UtenImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void UtenImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(0, 0, uten_Logo_width, uten_Logo_height, uten_bits);
}

/***********************************************************************
   FUNCTION:    UtenImage
   DESCRIPTION: UtenImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void PotentiometerImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(40, 5, potentiometer_Logo_width, potentiometer_Logo_height, potentiometer_bits);
}

/***********************************************************************
   FUNCTION:    LdrImage
   DESCRIPTION: LdrImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void LdrImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(40, 5, ldr_Logo_width, ldr_Logo_height, ldr_bits);
}

/***********************************************************************
   FUNCTION:    PayuthImage
   DESCRIPTION: PayuthImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void PayuthImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(0, 0, payuth_Logo_width, payuth_Logo_height, payuth_bits);
}

/***********************************************************************
   FUNCTION:    Dip3swImage
   DESCRIPTION: Dip3swImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void Dip3swImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(20, 3, dip3sw_Logo_width, dip3sw_Logo_height, dip3sw_bits);
}

/***********************************************************************
   FUNCTION:    MjuImage
   DESCRIPTION: MjuImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void MjuImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(15, 3, mju_Logo_width, mju_Logo_height, mju_bits);
}

/***********************************************************************
   FUNCTION:    InputImage
   DESCRIPTION: InputImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void InputImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(0, 0, input_Logo_width, input_Logo_height, input_bits);
}

/***********************************************************************
   FUNCTION:    SwitchImage
   DESCRIPTION: SwitchImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void SwitchImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(0, 0, switch_Logo_width, switch_Logo_height, switch_bits);
}

/***********************************************************************
   FUNCTION:    NetpieImage
   DESCRIPTION: NetpieImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void NetpieImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(0, 0, netpie_Logo_width, netpie_Logo_height, netpie_bits);
}

/***********************************************************************
   FUNCTION:    AmpereImage
   DESCRIPTION: AmpereImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void AmpereImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(0, 0, ampere_Logo_width, ampere_Logo_height, ampere_bits);
}

/***********************************************************************
   FUNCTION:    BlynkImage
   DESCRIPTION: BlynkImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void BlynkImage()
{
  // see http://blog.squix.org/2015/05/esp8266-nodemcu-how-to-create-xbm.html
  // on how to create xbm files
  display.drawXbm(0, 0, blynk_Logo_width, blynk_Logo_height, blynk_bits);
}

/***********************************************************************
   FUNCTION:    BatteryImage
   DESCRIPTION: BatteryImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void BatteryImage()
{
  display.drawXbm(0, 0, battery_Logo_width, battery_Logo_height, battery_bits);
}

/***********************************************************************
   FUNCTION:    HospitalImage
   DESCRIPTION: HospitalImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void HospitalImage()
{
  display.drawXbm(0, 0, hospital_Logo_width, hospital_Logo_height, hospital_bits);
}

/***********************************************************************
   FUNCTION:    PoliceImage
   DESCRIPTION: PoliceImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void PoliceImage()
{
  display.drawXbm(0, 0, police_Logo_width, police_Logo_height, police_bits);
}

/***********************************************************************
   FUNCTION:    ChaiImage
   DESCRIPTION: ChaiImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void ChaiImage()
{
  display.drawXbm(0, 0, chai_Logo_width, chai_Logo_height, chai_bits);
}

/***********************************************************************
   FUNCTION:    AddImage
   DESCRIPTION: AddImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void AddImage()
{
  display.drawXbm(0, 0, add_Logo_width, add_Logo_height, add_bits);
}

/***********************************************************************
   FUNCTION:    ChatchatImage
   DESCRIPTION: ChatchatImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void ChatchatImage()
{
  display.drawXbm(0, 0, chatchat_Logo_width, chatchat_Logo_height, chatchat_bits);
}

/***********************************************************************
   FUNCTION:    WorkworkworkImage
   DESCRIPTION: WorkworkworkImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void WorkworkworkImage()
{
  display.drawXbm(0, 0, workworkwork_Logo_width, workworkwork_Logo_height, workworkwork_bits);
}

/***********************************************************************
   FUNCTION:    ChawarojImage
   DESCRIPTION: ChawarojImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void ChawarojImage()
{
  display.drawXbm(0, 0, chawaroj_Logo_width, chawaroj_Logo_height, chawaroj_bits);
}

/***********************************************************************
   FUNCTION:    ManopImage
   DESCRIPTION: ManopImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void ManopImage()
{
  display.drawXbm(0, 0, manop_Logo_width, manop_Logo_height, manop_bits);
}

