tenergyinnovation/esp32_iot_all_v3/src/esp32_iot_all_v3.cpp
/***********************************************************************
   FUNCTION:    ElleImage
   DESCRIPTION: ElleImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void ElleImage()
{
  display.drawXbm(0, 0, elle_Logo_width, elle_Logo_height, elle_bits);
}

/***********************************************************************
   FUNCTION:    PanImage
   DESCRIPTION: PanImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void PanImage()
{
  display.drawXbm(0, 0, pan_Logo_width, pan_Logo_height, pan_bits);
}

/***********************************************************************
   FUNCTION:    RboeImage
   DESCRIPTION: RboeImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void RboeImage()
{
  display.drawXbm(0, 0, rboe_Logo_width, rboe_Logo_height, rboe_bits);
}

/***********************************************************************
   FUNCTION:    TleImage
   DESCRIPTION: TleImage
   PARAMETERS:  nothing
   RETURNED:    nothing
 ***********************************************************************/
void TleImage()
{
  display.drawXbm(0, 0, tle_Logo_width, tle_Logo_height, tle_bits);
}

#pragma endregion

/***********************************************************************
 * FUNCTION:    PZEM_016
 * DESCRIPTION: Read value from PZEM-016 Modbus RTU power meter module
 * PARAMETERS:  address(id)
 * RETURNED:    true, false and reference parameter => volt, amp, power, energy, freq, pf
 ***********************************************************************/
bool esp32_iot_all_v3::PZEM_016(uint8_t id, float &volt, float &amp, float &power, uint32_t &energy, float &freq, float &pf)
{
  // #define modbusRTU_Debug

  uint16_t _crc = 0xffff;
  uint16_t _crc_r = 0xffff;
  uint16_t _temp_hex_16bit = 0xffff;
  uint32_t _temp_hex_32bit = 0x00000000;

  uint8_t _data_write[8];
  uint8_t _data_read[40];
  uint8_t _byte_cnt = 0;
  uint8_t _data_check[25];

  _data_write[0] = id;
  _data_write[1] = 0x04;
  _data_write[2] = 0x00;
  _data_write[3] = 0x00;
  _data_write[4] = 0x00;
  _data_write[5] = 0x0A;

  // Generate CRC16
  for (byte _i = 0; _i < sizeof(_data_write) - 2; _i++)
  {
    _crc = crc16_update(_crc, _data_write[_i]);
  }

  // Insert CRC16 to data byte
#ifdef modbusRTU_Debug
  Serial.printf("_crc = 0x%02X\r\n", _crc);
#endif
  _data_write[sizeof(_data_write) - 1] = _crc >> 8;
  _data_write[sizeof(_data_write) - 2] = _crc - _data_write[sizeof(_data_write) - 1] * 0x0100;

#pragma region
/***** Debug monitor ****/
#ifdef modbusRTU_Debug
  Serial.printf("Data write(%d): [ ", sizeof(_data_write));
  for (byte _i = 0; _i < sizeof(_data_write); _i++)
  {
    if (_data_write[_i] > 0x0F)
    {
      Serial.printf("0x%X ", _data_write[_i]);
    }
    else
    {
      Serial.printf("0x0%X ", _data_write[_i]);
    }
  }
  Serial.printf("]\r\n");
#endif
#pragma endregion

  /**** Write data ****/
  rs485.flush();
  for (int _i = 0; _i < 8; _i++)
    rs485.write(_data_write[_i]);

  vTaskDelay(300);

  /**** Read data ****/
  if (rs485.available())
  {

    for (byte _i = 0; _i < sizeof(_data_read); _i++)
      _data_read[_i] = 0x00; // clear buffer
    _byte_cnt = 0;

    // correct data
    do
    {
      _data_read[_byte_cnt++] = rs485.read();
      if (_data_read[0] == 0x00)
      { //แก้ไช bug เนื่องจากอ่านค่าแรกได้ 0x00
        _byte_cnt = 0;
      }
      // }while(rs485.available()>0);
    } while (rs485.available() > 0 && _byte_cnt < sizeof(_data_read));

/***** Debug monitor ****/
#ifdef modbusRTU_Debug
    Serial.printf("Data read(%d): [ ", _byte_cnt);
    for (byte _i = 0; _i < _byte_cnt; _i++)
    {
      if (_data_read[_i] > 0x0F)
      {
        Serial.printf("0x%X ", _data_read[_i]);
      }
      else
      {
        Serial.printf("0x0%X ", _data_read[_i]);
      }
    }
    Serial.println("]");
#endif
  }

  /**** correct data to buffer variable ****/
  if (_byte_cnt == 25)
  {

    // Collect data
    for (int i = 0; i < 25; i++)
    {
      _data_check[i] = _data_read[i];
    }

/***** Debug monitor ****/
#ifdef modbusRTU_Debug
    Serial.printf("Data check(%d): [ ", sizeof(_data_check));
    for (byte _i = 0; _i < sizeof(_data_check); _i++)
    {
      if (_data_check[_i] > 0x0F)
      {
        Serial.printf("0x%X ", _data_check[_i]);
      }
      else
      {
        Serial.printf("0x0%X ", _data_check[_i]);
      }
    }
    Serial.println("]");
#endif
  }
  else if (_byte_cnt > 25)
  {

    uint8_t _addcnt = _byte_cnt - 25; //ตัวแปรชดเชยการอ่านค่าผิดตำแหน่ง

    // Collect data
    for (int i = 0; i < 25; i++)
    {
      _data_check[i] = _data_read[i + _addcnt];
    }

/***** Debug monitor ****/
#ifdef modbusRTU_Debug
    Serial.printf("Data check(%d): [ ", sizeof(_data_check));
    for (byte _i = 0; _i < sizeof(_data_check); _i++)
    {
      if (_data_check[_i] > 0x0F)
      {
        Serial.printf("0x%X ", _data_check[_i]);
      }
      else
      {
        Serial.printf("0x0%X ", _data_check[_i]);
      }
    }
    Serial.println("]");
#endif
  }
  else
  {
    Serial.printf("Error: data error\r\n");
    return 0;
  }

  /*** crc check for data read ***/
  _crc = 0xffff;
  _crc_r = 0xffff;

  // Generate CRC16
  for (byte _i = 0; _i < sizeof(_data_check) - 2; _i++)
  {
    _crc = crc16_update(_crc, _data_check[_i]);
  }
#ifdef modbusRTU_Debug
  Serial.printf("Debug: _crc = 0x%X\r\n", _crc);
#endif

  // read crc byte from data_check
  _crc_r = _data_check[sizeof(_data_check) - 1];          // Serial.print(">>"); Serial.println(_crc_r,HEX);
  _crc_r = _crc_r << 8;                                   // Serial.print(">>"); Serial.println(_crc_r,HEX);
  _crc_r = _crc_r + _data_check[sizeof(_data_check) - 2]; // Serial.print(">>"); Serial.println(_crc_r,HEX);
#ifdef modbusRTU_Debug
  Serial.printf("Debug: _crc_r = 0x%X\r\n", _crc_r);
#endif

