tenergyinnovation/esp32_iot_all_v3/src/esp32_iot_all_v3.cpp
  // return ON/OFF status
  if (_crc_r == _crc)
  {

    //**** Read volt ****
    _temp_hex_16bit = _data_check[3];                   // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit << 8;             // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit | _data_check[4]; // Serial.printf("Debug: _temp_hex_16bit = 0x%X(%d)\r\n",_temp_hex_16bit,_temp_hex_16bit);
    volt = (float)_temp_hex_16bit * 0.1;

#ifdef modbusRTU_Debug
    Serial.printf("Debug: volt[hex] => %.d\r\n", _temp_hex_16bit);
    Serial.printf("Debug: volt[float] => %.1f\r\n", volt);
#endif

    //**** Read Current ****
    _temp_hex_32bit = 0x00000000; // clear buffer

    _temp_hex_16bit = _data_check[7];                   // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit << 8;             // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit | _data_check[8]; // Serial.printf("Debug: _temp_hex_16bit = 0x%X(%d)\r\n",_temp_hex_16bit,_temp_hex_16bit);

    _temp_hex_32bit = _temp_hex_32bit | _temp_hex_16bit; // Serial.printf("Debug: _temp_hex_32bit = 0x%X(%d)\r\n",_temp_hex_32bit,_temp_hex_32bit);
    _temp_hex_32bit = _temp_hex_32bit << 16;             // Serial.printf("Debug: _temp_hex_32bit = 0x%X(%d)\r\n",_temp_hex_32bit,_temp_hex_32bit);

    _temp_hex_16bit = _data_check[5];                   // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit << 8;             // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit | _data_check[6]; // Serial.printf("Debug: _temp_hex_16bit = 0x%X(%d)\r\n",_temp_hex_16bit,_temp_hex_16bit);

    _temp_hex_32bit = _temp_hex_32bit | _temp_hex_16bit; // Serial.printf("Debug: _temp_hex_32bit* = 0x%X(%d)\r\n",_temp_hex_32bit,_temp_hex_32bit);
    amp = (float)_temp_hex_32bit * 0.001;

#ifdef modbusRTU_Debug
    Serial.printf("Debug: amp[hex] => %.d\r\n", _temp_hex_32bit);
    Serial.printf("Debug: amp[float] => %.1f\r\n", amp);
#endif

    //**** Read Power ****
    _temp_hex_32bit = 0x00000000; // clear buffer

    _temp_hex_16bit = _data_check[11];                   // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit << 8;              // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit | _data_check[12]; // Serial.printf("Debug: _temp_hex_16bit = 0x%X(%d)\r\n",_temp_hex_16bit,_temp_hex_16bit);

    _temp_hex_32bit = _temp_hex_32bit | _temp_hex_16bit; // Serial.printf("Debug: _temp_hex_32bit = 0x%X(%d)\r\n",_temp_hex_32bit,_temp_hex_32bit);
    _temp_hex_32bit = _temp_hex_32bit << 16;             // Serial.printf("Debug: _temp_hex_32bit = 0x%X(%d)\r\n",_temp_hex_32bit,_temp_hex_32bit);

    _temp_hex_16bit = _data_check[9];                    // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit << 8;              // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit | _data_check[10]; // Serial.printf("Debug: _temp_hex_16bit = 0x%X(%d)\r\n",_temp_hex_16bit,_temp_hex_16bit);

    _temp_hex_32bit = _temp_hex_32bit | _temp_hex_16bit; // Serial.printf("Debug: _temp_hex_32bit* = 0x%X(%d)\r\n",_temp_hex_32bit,_temp_hex_32bit);
    power = (float)_temp_hex_32bit * 0.1;

#ifdef modbusRTU_Debug
    Serial.printf("Debug: power[hex] => %.d\r\n", _temp_hex_32bit);
    Serial.printf("Debug: power[float] => %.1f\r\n", power);
#endif

    //**** Read Engergy ****
    _temp_hex_32bit = 0x00000000; // clear buffer

    _temp_hex_16bit = _data_check[15];                   // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit << 8;              // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit | _data_check[16]; // Serial.printf("Debug: _temp_hex_16bit = 0x%X(%d)\r\n",_temp_hex_16bit,_temp_hex_16bit);

    _temp_hex_32bit = _temp_hex_32bit | _temp_hex_16bit; // Serial.printf("Debug: _temp_hex_32bit = 0x%X(%d)\r\n",_temp_hex_32bit,_temp_hex_32bit);
    _temp_hex_32bit = _temp_hex_32bit << 16;             // Serial.printf("Debug: _temp_hex_32bit = 0x%X(%d)\r\n",_temp_hex_32bit,_temp_hex_32bit);

    _temp_hex_16bit = _data_check[13];                   // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit << 8;              // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit | _data_check[14]; // Serial.printf("Debug: _temp_hex_16bit = 0x%X(%d)\r\n",_temp_hex_16bit,_temp_hex_16bit);

    _temp_hex_32bit = _temp_hex_32bit | _temp_hex_16bit; // Serial.printf("Debug: _temp_hex_32bit* = 0x%X(%d)\r\n",_temp_hex_32bit,_temp_hex_32bit);
    energy = (float)_temp_hex_32bit;

#ifdef modbusRTU_Debug
    Serial.printf("Debug: energy[hex] => %.d\r\n", _temp_hex_32bit);
    Serial.printf("Debug: energy[float] => %.1f\r\n", energy);
#endif

    //**** Read Frequency ****
    _temp_hex_16bit = _data_check[17];                   // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit << 8;              // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit | _data_check[18]; // Serial.printf("Debug: _temp_hex_16bit = 0x%X(%d)\r\n",_temp_hex_16bit,_temp_hex_16bit);
    freq = (float)_temp_hex_16bit * 0.1;

#ifdef modbusRTU_Debug
    Serial.printf("Debug: frequency[hex] => %.d\r\n", _temp_hex_16bit);
    Serial.printf("Debug: frequency[float] => %.1f\r\n", freq);
#endif

    //**** Read power factor ****
    _temp_hex_16bit = _data_check[19];                   // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit << 8;              // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit | _data_check[20]; // Serial.printf("Debug: _temp_hex_16bit = 0x%X(%d)\r\n",_temp_hex_16bit,_temp_hex_16bit);
    pf = (float)_temp_hex_16bit * 0.01;

#ifdef modbusRTU_Debug
    Serial.printf("Debug: Power factor[hex] => %.d\r\n", _temp_hex_16bit);
    Serial.printf("Debug: Power factor[float] => %.01f\r\n", pf);
#endif

    return 1;
  }
  else
  {
    Serial.printf("Error: crc16\r\n");
    return 0;
  }
}

/***********************************************************************
 * FUNCTION:    PZEM_016_Volt
 * DESCRIPTION: Read value from PZEM-016 Modbus RTU power meter module
 * PARAMETERS:  address(id)
 * RETURNED:    volt
 ***********************************************************************/
float esp32_iot_all_v3::PZEM_016_Volt(uint8_t id)
{
  float _volt;
  //#define modbusRTU_Debug

  uint16_t _crc = 0xffff;
  uint16_t _crc_r = 0xffff;
  uint16_t _temp_hex_16bit = 0xffff;
  uint8_t _data_write[8];
  uint8_t _data_read[40];
  uint8_t _byte_cnt = 0;
  uint8_t _data_check[25];

  _data_write[0] = id;
  _data_write[1] = 0x04;
  _data_write[2] = 0x00;
  _data_write[3] = 0x00;
  _data_write[4] = 0x00;
  _data_write[5] = 0x0A;

  // Generate CRC16
  for (byte _i = 0; _i < sizeof(_data_write) - 2; _i++)
  {
    _crc = crc16_update(_crc, _data_write[_i]);
  }

  // Insert CRC16 to data byte
#ifdef modbusRTU_Debug
  Serial.printf("_crc = 0x%02X\r\n", _crc);
#endif
  _data_write[sizeof(_data_write) - 1] = _crc >> 8;
  _data_write[sizeof(_data_write) - 2] = _crc - _data_write[sizeof(_data_write) - 1] * 0x0100;

#pragma region
/***** Debug monitor ****/
#ifdef modbusRTU_Debug
  Serial.printf("Data write(%d): [ ", sizeof(_data_write));
  for (byte _i = 0; _i < sizeof(_data_write); _i++)
  {
    if (_data_write[_i] > 0x0F)
    {
      Serial.printf("0x%X ", _data_write[_i]);
    }
    else
    {
      Serial.printf("0x0%X ", _data_write[_i]);
    }
  }
  Serial.printf("]\r\n");
#endif
#pragma endregion

