tenergyinnovation/esp32_iot_all_v3/src/esp32_iot_all_v3.cpp
  // return ON/OFF status
  if (_crc_r == _crc)
  {

    Serial.printf("Info: PZEM-003 Reset Engergy Success\r\n");
    return 1;
  }
  else
  {
    Serial.printf("Error: crc16\r\n");
    return 0;
  }
}

/***********************************************************************
 * FUNCTION:    PZEM_003_SetAddress
 * DESCRIPTION: Reset Energy value for PZEM-003 Modbus RTU power meter module
 * PARAMETERS:  address id, new_id
 * RETURNED:   new_id
 ***********************************************************************/
int8_t esp32_iot_all_v3::PZEM_003_SetAddress(uint8_t id, uint8_t new_id)
{

  /*check parameter*/
  if (new_id >= 0x7F)
  {
    Serial.printf("Error: Address is out of the range[1-127]\r\n");
    return -1;
  }

  // #define modbusRTU_Debug

  uint16_t _crc = 0xffff;
  uint16_t _crc_r = 0xffff;
  uint8_t _data_write[8];
  uint8_t _data_read[40];
  uint8_t _byte_cnt = 0;
  uint8_t _data_check[8];

  _data_write[0] = id;
  _data_write[1] = 0x06;
  _data_write[2] = 0x00;
  _data_write[3] = 0x02;
  _data_write[4] = 0x00;
  _data_write[5] = new_id;

  // Generate CRC16
  for (byte _i = 0; _i < sizeof(_data_write) - 2; _i++)
  {
    _crc = crc16_update(_crc, _data_write[_i]);
  }

  // Insert CRC16 to data byte
#ifdef modbusRTU_Debug
  Serial.printf("_crc = 0x%02X\r\n", _crc);
#endif
  _data_write[sizeof(_data_write) - 1] = _crc >> 8;
  _data_write[sizeof(_data_write) - 2] = _crc - _data_write[sizeof(_data_write) - 1] * 0x0100;

#pragma region
/***** Debug monitor ****/
#ifdef modbusRTU_Debug
  Serial.printf("Data write(%d): [ ", sizeof(_data_write));
  for (byte _i = 0; _i < sizeof(_data_write); _i++)
  {
    if (_data_write[_i] > 0x0F)
    {
      Serial.printf("0x%X ", _data_write[_i]);
    }
    else
    {
      Serial.printf("0x0%X ", _data_write[_i]);
    }
  }
  Serial.printf("]\r\n");
#endif
#pragma endregion

  /**** Write data ****/
  rs485_2.flush();
  for (int _i = 0; _i < 8; _i++)
    rs485_2.write(_data_write[_i]);

  vTaskDelay(300);

  /**** Read data ****/
  if (rs485_2.available())
  {

    for (byte _i = 0; _i < sizeof(_data_read); _i++)
      _data_read[_i] = 0x00; // clear buffer
    _byte_cnt = 0;

    // correct data
    do
    {
      _data_read[_byte_cnt++] = rs485_2.read();
      if (_data_read[0] == 0x00)
      { //แก้ไช bug เนื่องจากอ่านค่าแรกได้ 0x00
        _byte_cnt = 0;
      }
      // }while(rs485_2.available()>0);
    } while (rs485_2.available() > 0 && _byte_cnt < sizeof(_data_read));

/***** Debug monitor ****/
#ifdef modbusRTU_Debug
    Serial.printf("Data read(%d): [ ", _byte_cnt);
    for (byte _i = 0; _i < _byte_cnt; _i++)
    {
      if (_data_read[_i] > 0x0F)
      {
        Serial.printf("0x%X ", _data_read[_i]);
      }
      else
      {
        Serial.printf("0x0%X ", _data_read[_i]);
      }
    }
    Serial.println("]");
    Serial.printf("Byte count = %d\r\n", _byte_cnt);
#endif
  }

  if (_byte_cnt == 8)
  {

    _data_check[0] = _data_read[0];
    _data_check[1] = _data_read[1];
    _data_check[2] = _data_read[2];

    _data_check[3] = _data_read[3];
    _data_check[4] = _data_read[4];

    _data_check[5] = _data_read[5];
    _data_check[6] = _data_read[6];
    _data_check[7] = _data_read[7];

/***** Debug monitor ****/
#ifdef modbusRTU_Debug
    Serial.printf("Data check(%d): [ ", sizeof(_data_check));
    for (byte _i = 0; _i < sizeof(_data_check); _i++)
    {
      if (_data_check[_i] > 0x0F)
      {
        Serial.printf("0x%X ", _data_check[_i]);
      }
      else
      {
        Serial.printf("0x0%X ", _data_check[_i]);
      }
    }
    Serial.println("]");
#endif
  }
  else if (_byte_cnt > 8)
  {
    uint8_t _addcnt = _byte_cnt - 8;
    for (int i = 0; i < 8; i++)
    {
      _data_check[i] = _data_read[i + _addcnt];
    }

/***** Debug monitor ****/
#ifdef modbusRTU_Debug
    Serial.printf("Data check(%d): [ ", sizeof(_data_check));
    for (byte _i = 0; _i < sizeof(_data_check); _i++)
    {
      if (_data_check[_i] > 0x0F)
      {
        Serial.printf("0x%X ", _data_check[_i]);
      }
      else
      {
        Serial.printf("0x0%X ", _data_check[_i]);
      }
    }
    Serial.println("]");
#endif
  }
  else
  {
    Serial.printf("Error: data error\r\n");
    return -1;
  }

  /*** crc check for data read ***/
  _crc = 0xffff;
  _crc_r = 0xffff;

  // Generate CRC16
  for (byte _i = 0; _i < sizeof(_data_check) - 2; _i++)
  {
    _crc = crc16_update(_crc, _data_check[_i]);
  }
#ifdef modbusRTU_Debug
  Serial.printf("Debug: _crc = 0x%X\r\n", _crc);
#endif

  // read crc byte from data_check
  _crc_r = _data_check[sizeof(_data_check) - 1];          // Serial.print(">>"); Serial.println(_crc_r,HEX);
  _crc_r = _crc_r << 8;                                   // Serial.print(">>"); Serial.println(_crc_r,HEX);
  _crc_r = _crc_r + _data_check[sizeof(_data_check) - 2]; // Serial.print(">>"); Serial.println(_crc_r,HEX);
#ifdef modbusRTU_Debug
  Serial.printf("Debug: _crc_r = 0x%X\r\n", _crc_r);
#endif

  // return ON/OFF status
  if (_crc_r == _crc)
  {

    Serial.printf("Info: Success to set new Address[%d]\r\n", new_id);
    return new_id;
  }
  else
  {
    Serial.printf("Error: crc16\r\n");
    return -1;
  }
}

/***********************************************************************
 * FUNCTION:    PZEM_003_SearchAddress
 * DESCRIPTION: Search Address from PZEM-003 Modbus RTU power meter module
 * PARAMETERS:  nothing
 * RETURNED:    Address
 ***********************************************************************/

int8_t esp32_iot_all_v3::PZEM_003_SearchAddress(void)
{

  uint8_t _id;

  // #define modbusRTU_Debug

  uint16_t _crc = 0xffff;
  uint16_t _crc_r = 0xffff;
  uint8_t _data_write[8];
  uint8_t _data_read[40];
  uint8_t _byte_cnt = 0;
  uint8_t _data_check[21];

  /* Find ID from 1 to 127*/
  for (_id = 1; _id <= 127; _id++)
  {

    /*clear data*/
    _crc = 0xffff;
    _crc_r = 0xffff;
    _byte_cnt = 0;
    for (int i = 0; i < sizeof(_data_check); i++)
    {
      _data_read[i] = 0x00;
      _data_check[i] = 0x00;
    }

    _data_write[0] = _id;
    _data_write[1] = 0x04;
    _data_write[2] = 0x00;
    _data_write[3] = 0x00;
    _data_write[4] = 0x00;
    _data_write[5] = 0x08;

    // Generate CRC16
    for (byte _i = 0; _i < sizeof(_data_write) - 2; _i++)
    {
      _crc = crc16_update(_crc, _data_write[_i]);
    }

    // Insert CRC16 to data byte
#ifdef modbusRTU_Debug
    Serial.printf("_crc = 0x%02X\r\n", _crc);
#endif
    _data_write[sizeof(_data_write) - 1] = _crc >> 8;
    _data_write[sizeof(_data_write) - 2] = _crc - _data_write[sizeof(_data_write) - 1] * 0x0100;

#pragma region
/***** Debug monitor ****/
#ifdef modbusRTU_Debug
    Serial.printf("Data write(%d): [ ", sizeof(_data_write));
    for (byte _i = 0; _i < sizeof(_data_write); _i++)
    {
      if (_data_write[_i] > 0x0F)
      {
        Serial.printf("0x%X ", _data_write[_i]);
      }
      else
      {
        Serial.printf("0x0%X ", _data_write[_i]);
      }
    }
    Serial.printf("]\r\n");
#endif
#pragma endregion

