tenergyinnovation/esp32_iot_all_v3/src/esp32_iot_all_v3.cpp
  // return ON/OFF status
  if (_crc_r == _crc)
  {

    //**** Read Humidity ****
    _temp_hex_16bit = _data_check[3];                   // Serial.printf("Debug: _temp_hex = 0x%X\r\n",_temp_hex);
    _temp_hex_16bit = _temp_hex_16bit << 8;             // Serial.printf("Debug: _temp_hex = 0x%X\r\n",_temp_hex);
    _temp_hex_16bit = _temp_hex_16bit | _data_check[4]; // Serial.printf("Debug: _temp_hex = 0x%X(%d)\r\n",_temp_hex,_temp_hex);
    _humi = (float)_temp_hex_16bit / 10;

#ifdef modbusRTU_Debug
    Serial.printf("Debug: temp[hex] => %.d\r\n", _temp_hex_16bit);
    Serial.printf("Debug: temp[float] => %.1f\r\n", temp);
#endif

    //**** Read temperature ****
    _temp_hex_16bit = _data_check[5];                   // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit << 8;             // Serial.printf("Debug: _temp_hex_16bit = 0x%X\r\n",_temp_hex_16bit);
    _temp_hex_16bit = _temp_hex_16bit | _data_check[6]; // Serial.printf("Debug: _temp_hex_16bit = 0x%X(%d)\r\n",_temp_hex_16bit,_temp_hex_16bit);
    _temp = (float)_temp_hex_16bit / 10;

#ifdef modbusRTU_Debug
    Serial.printf("Debug: humi[hex] => %.d\r\n", _temp_hex_16bit);
    Serial.printf("Debug: humi[float] => %.1f\r\n", humi);
#endif

    return _humi;
  }
  else
  {
    Serial.printf("Error: crc16\r\n");
    return -1;
  }
}

/***********************************************************************
 * FUNCTION:    WATER_FLOW_METER_begin
 * DESCRIPTION: set RX and TX pin
 * PARAMETERS:  rx, tx
 * RETURNED:    true/ false
 ***********************************************************************/
bool esp32_iot_all_v3::WATER_FLOW_METER_begin(uint8_t rx, uint8_t tx)
{

  if (((tx == TXD2) || (tx == TXD3)) && ((rx == RXD2) || (rx == RXD3)))
  {
    rs485.begin(9600, SERIAL_8N1, rx, tx);
    return 1;
  }
  else
  {
    Serial.printf("Error: Fail to define RS485 port!!\r\n");
    return 0;
  }
}

/***********************************************************************
 * FUNCTION:    WATER_FLOW_METER_searchAddress
 * DESCRIPTION: Search Address from WATER_FLOW_METER Module [1-252]
 * PARAMETERS:  nothing
 * RETURNED:    Address
 ***********************************************************************/
int8_t esp32_iot_all_v3::WATER_FLOW_METER_searchAddress(void)
{
  uint8_t _id;

  // #define modbusRTU_Debug

  uint16_t _crc = 0xffff;
  uint16_t _crc_r = 0xffff;
  uint8_t _data_write[8];
  uint8_t _data_read[20];
  uint8_t _byte_cnt = 0;
  uint8_t _data_check[8];

  /* Find ID from 1 to 252*/
  for (_id = 1; _id <= 252; _id++)
  {

    /*clear data*/
    _crc = 0xffff;
    _crc_r = 0xffff;
    _byte_cnt = 0;
    for (int i = 0; i < sizeof(_data_check); i++)
    {
      _data_read[i] = 0x00;
      _data_check[i] = 0x00;
    }

    _data_write[0] = _id;
    _data_write[1] = 0x03;
    _data_write[2] = 0x00;
    _data_write[3] = 0x00;
    _data_write[4] = 0x00;
    _data_write[5] = 0x01;

    // Generate CRC16
    for (byte _i = 0; _i < sizeof(_data_write) - 2; _i++)
    {
      _crc = crc16_update(_crc, _data_write[_i]);
    }

    // Insert CRC16 to data byte
#ifdef modbusRTU_Debug
    Serial.printf("_crc = 0x%02X\r\n", _crc);
#endif
    _data_write[sizeof(_data_write) - 1] = _crc >> 8;
    _data_write[sizeof(_data_write) - 2] = _crc - _data_write[sizeof(_data_write) - 1] * 0x0100;

#pragma region
/***** Debug monitor ****/
#ifdef modbusRTU_Debug
    Serial.printf("Data write(%d): [ ", sizeof(_data_write));
    for (byte _i = 0; _i < sizeof(_data_write); _i++)
    {
      if (_data_write[_i] > 0x0F)
      {
        Serial.printf("0x%X ", _data_write[_i]);
      }
      else
      {
        Serial.printf("0x0%X ", _data_write[_i]);
      }
    }
    Serial.printf("]\r\n");
#endif
#pragma endregion

    /**** Write data ****/
    rs485.flush();
    for (int _i = 0; _i < 8; _i++)
      rs485.write(_data_write[_i]);

    vTaskDelay(300);

    /**** Read data ****/
    if (rs485.available())
    {

      for (byte _i = 0; _i < sizeof(_data_read); _i++)
        _data_read[_i] = 0x00; // clear buffer
      _byte_cnt = 0;

      // correct data
      do
      {
        _data_read[_byte_cnt++] = rs485.read();
        if (_data_read[0] == 0x00)
        { //แก้ไช bug เนื่องจากอ่านค่าแรกได้ 0x00
          _byte_cnt = 0;
        }
        // }while(rs485.available()>0);
      } while (rs485.available() > 0 && _byte_cnt < sizeof(_data_read));

/***** Debug monitor ****/
#ifdef modbusRTU_Debug
      Serial.printf("Data read(%d): [ ", _byte_cnt);
      for (byte _i = 0; _i < _byte_cnt; _i++)
      {
        if (_data_read[_i] > 0x0F)
        {
          Serial.printf("0x%X ", _data_read[_i]);
        }
        else
        {
          Serial.printf("0x0%X ", _data_read[_i]);
        }
      }
      Serial.println("]");
#endif
    }

    /* Collect data to variable buffer */
    if (_byte_cnt == 7)
    {

      for (int i = 0; i < 7; i++)
      {
        _data_check[i] = _data_read[i];
      }

/***** Debug monitor ****/
#ifdef modbusRTU_Debug
      Serial.printf("Data check(%d): [ ", sizeof(_data_check));
      for (byte _i = 0; _i < sizeof(_data_check); _i++)
      {
        if (_data_check[_i] > 0x0F)
        {
          Serial.printf("0x%X ", _data_check[_i]);
        }
        else
        {
          Serial.printf("0x0%X ", _data_check[_i]);
        }
      }
      Serial.println("]");
#endif

      /*** crc check for data read ***/
      _crc = 0xffff;
      _crc_r = 0xffff;

      // Generate CRC16
      for (byte _i = 0; _i < sizeof(_data_check) - 2; _i++)
      {
        _crc = crc16_update(_crc, _data_check[_i]);
      }
#ifdef modbusRTU_Debug
      Serial.printf("Debug: _crc = 0x%X\r\n", _crc);
#endif

      // read crc byte from data_check
      _crc_r = _data_check[sizeof(_data_check) - 1];          // Serial.print(">>"); Serial.println(_crc_r,HEX);
      _crc_r = _crc_r << 8;                                   // Serial.print(">>"); Serial.println(_crc_r,HEX);
      _crc_r = _crc_r + _data_check[sizeof(_data_check) - 2]; // Serial.print(">>"); Serial.println(_crc_r,HEX);
#ifdef modbusRTU_Debug
      Serial.printf("Debug: _crc_r = 0x%X\r\n", _crc_r);
#endif

