tenergyinnovation/esp32_iot_all_v3/src/esp32_iot_all_v3.cpp
  // return ON/OFF status
  if (_crc_r == _crc)
  {

    /* val1 process */
    _sResult = _data_check[5];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;             // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[6]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;             // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[3]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;             // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[4]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val1 = (*(float *)&_sResult);         //**Floating point 16bit convert

    /* val2 process */
    _sResult = _data_check[9];             // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[10]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[7];  // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[8];  // Serial.print(">>"); Serial.println(_sResult,HEX);
    val2 = (*(float *)&_sResult);          //**Floating point 16bit convert

    /* val3 process */
    _sResult = _data_check[13];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[14]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[11]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[12]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val3 = (*(float *)&_sResult);          //**Floating point 16bit convert

    /* val4 process */
    _sResult = _data_check[17];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[18]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[15]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[16]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val4 = (*(float *)&_sResult);          //**Floating point 16bit convert

    /* val5 process */
    _sResult = _data_check[21];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[22]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[19]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[20]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val5 = (*(float *)&_sResult);          //**Floating point 16bit convert

    /* val6 process */
    _sResult = _data_check[25];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[26]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[23]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[24]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val6 = (*(float *)&_sResult);          //**Floating point 16bit convert

    /* val7 process */
    _sResult = _data_check[29];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[30]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[27]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[28]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val7 = (*(float *)&_sResult);          //**Floating point 16bit convert

    /* val8 process */
    _sResult = _data_check[33];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[34]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[31]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[32]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val8 = (*(float *)&_sResult);          //**Floating point 16bit convert

