tenergyinnovation/esp32_iot_all_v3/src/esp32_iot_all_v3.cpp
  /**** Write data ****/
  rs485.flush();
  for (int _i = 0; _i < sizeof(_data_write); _i++)
    rs485.write(_data_write[_i]);

  vTaskDelay(300);

  /**** Read data ****/
  if (rs485.available())
  {

    for (byte _i = 0; _i < sizeof(_data_read); _i++)
      _data_read[_i] = 0x00; // clear buffer
    _byte_cnt = 0;

    // correct data
    do
    {
      _data_read[_byte_cnt++] = rs485.read();
      if (_data_read[0] == 0x00)
      { //แก้ไช bug เนื่องจากอ่านค่าแรกได้ 0x00
        _byte_cnt = 0;
      }
      // }while(rs485.available()>0);
    } while (rs485.available() > 0 && _byte_cnt < sizeof(_data_read));

/***** Debug monitor ****/
#ifdef modbusRTU_Debug
    Serial.printf("Data read(%d): [ ", _byte_cnt);
    for (byte _i = 0; _i < _byte_cnt; _i++)
    {
      if (_data_read[_i] > 0x0F)
      {
        Serial.printf("0x%X ", _data_read[_i]);
      }
      else
      {
        Serial.printf("0x0%X ", _data_read[_i]);
      }
    }
    Serial.println("]");
#endif
  }

  /**** correct data to buffer variable ****/
  if (_byte_cnt == 33)
  {

    // Collect data
    for (int i = 0; i <= 44; i++)
    {
      _data_check[i] = _data_read[i];
    }

/***** Debug monitor ****/
#ifdef modbusRTU_Debug
    Serial.printf("Data check(%d): [ ", sizeof(_data_check));
    for (byte _i = 0; _i < sizeof(_data_check); _i++)
    {
      if (_data_check[_i] > 0x0F)
      {
        Serial.printf("0x%X ", _data_check[_i]);
      }
      else
      {
        Serial.printf("0x0%X ", _data_check[_i]);
      }
    }
    Serial.println("]");
#endif
  }
  else if (_byte_cnt > 33)
  {

    uint8_t _addcnt = _byte_cnt - 33; //ตัวแปรชดเชยการอ่านค่าผิดตำแหน่ง

    // Collect data
    for (int i = 0; i < 9; i++)
    {
      _data_check[i] = _data_read[i + _addcnt];
    }

/***** Debug monitor ****/
#ifdef modbusRTU_Debug
    Serial.printf("Data check(%d): [ ", sizeof(_data_check));
    for (byte _i = 0; _i < sizeof(_data_check); _i++)
    {
      if (_data_check[_i] > 0x0F)
      {
        Serial.printf("0x%X ", _data_check[_i]);
      }
      else
      {
        Serial.printf("0x0%X ", _data_check[_i]);
      }
    }
    Serial.println("]");
#endif
  }
  else
  {
    Serial.printf("Error: data error\r\n");
    return 0;
  }

  /*** crc check for data read ***/
  _crc = 0xffff;
  _crc_r = 0xffff;

  // Generate CRC16
  for (byte _i = 0; _i < sizeof(_data_check) - 2; _i++)
  {
    _crc = crc16_update(_crc, _data_check[_i]);
  }
#ifdef modbusRTU_Debug
// Serial.printf("Debug: _crc = 0x%X\r\n",_crc);
#endif

  // read crc byte from data_check
  _crc_r = _data_check[sizeof(_data_check) - 1];          // Serial.print(">>"); Serial.println(_crc_r,HEX);
  _crc_r = _crc_r << 8;                                   // Serial.print(">>"); Serial.println(_crc_r,HEX);
  _crc_r = _crc_r + _data_check[sizeof(_data_check) - 2]; // Serial.print(">>"); Serial.println(_crc_r,HEX);
#ifdef modbusRTU_Debug
  Serial.printf("Debug: _crc_r = 0x%X\r\n", _crc_r);
#endif

  // return ON/OFF status
  if (_crc_r == _crc)
  {

    /* val1 process */
    _sResult = _data_check[5];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;             // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[6]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;             // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[3]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;             // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[4]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val1 = (*(float *)&_sResult);         //**Floating point 16bit convert

    /* val2 process */
    _sResult = _data_check[9];             // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[10]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[7];  // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[8];  // Serial.print(">>"); Serial.println(_sResult,HEX);
    val2 = (*(float *)&_sResult);          //**Floating point 16bit convert

    /* val3 process */
    _sResult = _data_check[13];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[14]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[11]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[12]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val3 = (*(float *)&_sResult);          //**Floating point 16bit convert

    /* val4 process */
    _sResult = _data_check[17];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[18]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[15]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[16]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val4 = (*(float *)&_sResult);          //**Floating point 16bit convert

    /* val5 process */
    _sResult = _data_check[21];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[22]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[19]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[20]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val5 = (*(float *)&_sResult);          //**Floating point 16bit convert

    /* val6 process */
    _sResult = _data_check[25];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[26]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[23]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[24]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val6 = (*(float *)&_sResult);          //**Floating point 16bit convert

    /* val7 process */
    _sResult = _data_check[29];            // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[30]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[27]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult << 8;              // Serial.print(">>"); Serial.println(_sResult,HEX);
    _sResult = _sResult + _data_check[28]; // Serial.print(">>"); Serial.println(_sResult,HEX);
    val7 = (*(float *)&_sResult);          //**Floating point 16bit convert

#ifdef modbusRTU_Debug
    Serial.printf("Debug: val1 => %.2f\r\n", val1);
    Serial.printf("Debug: val2 => %.2f\r\n", val2);
    Serial.printf("Debug: val3 => %.2f\r\n", val3);
    Serial.printf("Debug: val4 => %.2f\r\n", val4);
    Serial.printf("Debug: val5 => %.2f\r\n", val5);
    Serial.printf("Debug: val6 => %.2f\r\n", val6);
    Serial.printf("Debug: val7 => %.2f\r\n", val7);
#endif
    return 1;
  }
  else
  {
    Serial.printf("Error: crc16\r\n");
    return 0;
  }
}

/***********************************************************************
 * FUNCTION:    tiny32_ModbusRTU
 * DESCRIPTION: tiny32 sensor read
 * PARAMETERS:  address
 * RETURNED:    referance variable [1-6]
 ***********************************************************************/
bool esp32_iot_all_v3::tiny32_ModbusRTU(uint8_t id, float &val1, float &val2, float &val3, float &val4, float &val5, float &val6)
{
  // #define modbusRTU_Debug
  uint16_t _crc = 0xffff;
  uint16_t _crc_r = 0xffff;
  uint16_t _temp_hex = 0xffff;
  unsigned long _sResult;
  // float _floatResult;

  uint8_t _data_write[8];
  uint8_t _data_read[50];
  uint8_t _byte_cnt = 0;
  uint8_t _data_check[29];

  _data_write[0] = id;
  _data_write[1] = 0x04;
  _data_write[2] = 0x00;
  _data_write[3] = 0x00;
  _data_write[4] = 0x00;
  _data_write[5] = 0x0C;

  // Generate CRC16
  for (byte _i = 0; _i < sizeof(_data_write) - 2; _i++)
  {
    _crc = crc16_update(_crc, _data_write[_i]);
  }

  // Insert CRC16 to data byte
#ifdef modbusRTU_Debug
  Serial.printf("_crc = 0x%02X\r\n", _crc);
#endif
  _data_write[sizeof(_data_write) - 1] = _crc >> 8;
  _data_write[sizeof(_data_write) - 2] = _crc - _data_write[sizeof(_data_write) - 1] * 0x0100;

#pragma region
/***** Debug monitor ****/
#ifdef modbusRTU_Debug
  Serial.printf("Data write(%d): [ ", sizeof(_data_write));
  for (byte _i = 0; _i < sizeof(_data_write); _i++)
  {
    if (_data_write[_i] > 0x0F)
    {
      Serial.printf("0x%X ", _data_write[_i]);
    }
    else
    {
      Serial.printf("0x0%X ", _data_write[_i]);
    }
  }
  Serial.printf("]\r\n");
#endif
#pragma endregion

